performance/jmx/Tx_Decode_Raw.jmx
<?xml version='1.0' encoding='UTF-8'?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Tx Decode Raw">
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments" />
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Tx Decode Raw">
        <intProp name="ThreadGroup.num_threads">200</intProp>
        <intProp name="ThreadGroup.ramp_time">60</intProp>
        <longProp name="ThreadGroup.duration">120</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Tx Decode Raw" enabled="true">
          <stringProp name="HTTPSampler.domain">127.0.0.1</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/v1/tbc/main/tx/raw/decode</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="用户定义的变量">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  "txHex": "0a00000002c4afc6a43754488bf9df4f1b17da1c31ae93b6c9f53201e5b572f28904b30a4c01000000fd010300483045022100d3d882647143c29e511e2707daf1db13a620c98d74b3fd5fb35e8655ada4f82d02206c84d9ef98e170215f799159774a229fe1d31a1487379410a70b0a355f15bf2d414830450221009565bbbe5d268d5491101c3a07f77d355c561f46cfc05617eca3aa10c52b39e802200df621caeef672f0dcf93181d483207e9f2c571efe3c1a7fbc00f4e45707c1b941473044022013ee45795702235a957b966fdaba0ae2a09eb7f1dffbe6f69359ed659983e05102200e6cc7d66fb152741b6df9b608607393045e4962642ec516b98fe855382ef29b4147304402202c3c97898d5e1cbb820c3a8701eb9f05ecd874cb4fdb84e35a409aa78ea7849602203e01ab9dac0f787ca05a2bbffa94a275fcab33c290312e955f4c7ec96d9df55d414730440220798282cb657842dd84ad3b3b7372a9d6d94a0653c52ca98db624695e54d1169602204227dcb47fe2f103a68c39f7675f1632031676331226a12c8cd94f4e9811448341483045022100a772bd24dea8e2bf1b50e311b1fb6014a9ce4bcf6ddc4aab6c978fc6064422c00220238304b31903584f3bbf40083376b2dbddec6a0ce6f70f7c35776823eeab822d414d4a0102893771a18d17e10eabb08718f7da8e10a825ee19c33c8b36b13d95375f6f4a03028c232cfd2d3757e50cb6af2e010819a942ab231c92406170ece0846b23d323b702a28a636088973c35ca0c28498b672cb8f61802164cf6904fc83463c4722c629202ac31c213b1dc1d2fd55d7751326b4f07b4a5b4ecb2ce3f214cafb7832fd211b902ac649c3eaf32886342b7d2ed83c01c24f297de2d006ad88e36017973644e304902ae22c8f0f43081d82fcca1eae4488992cdb0caa9c902ba7cbfa0eacc1c6312f002db1a62c168ac3e34d30c6e6beaef0918d39d448fe2a85aed24982e7368e2414d0308ad97a2bf08277be771fc5450b6a0fa26fbc6c1e57c402715b9135d5388594b035fe7599a7b39ad69fbd243aac7cfb93055f8f0827c6b08057874877cb890b80303929732b37e41a5a37b35122002c068f596432f4b9438ba4ac2a85e7dd31c3df4ffffffff491d789ee47ba70d97de5d87d74b0d152d3506f9c73f7a9eaf8e556775f2ff5a00000000fd33065108d0070000000000001c158a07aa9cc64d71ca194e2d695eb4d545e871235f000532436f6465200929631c3375fa0cd639bb08da8c74b22a411939ea21b7ded7cbbe440696a996021c0608000000000000000045006a300000000000000000b82211000000000000000000000000000000000000000000000000000000000000000000000000000106045553445404555344540546546170655208d0070000000000001c158a4274f167ecf97b8bf394b942425bff8f86efd3010532436f6465200929631c3375fa0cd639bb08da8c74b22a411939ea21b7ded7cbbe440696a996021c0608000000000000000045006a30000000000000000048c56548170000000000000000000000000000000000000000000000000000000000000000000000010604555344540455534454054654617065520884230300000000004c53567c01217f01217f01217f01217f01217f01217f01217f01217f01217f59795979597959795979597959795979597959797e7e7e7e7e7e7e7e7ea914a87114bb95a3ec4a16413b93b821b1641c122a34885aae0001535208000000000000000027006a2488888888f964f11d6fb0356e21c2d007e9ad8f6a8b2a17d0b4d2e3952236dc15460aa788000127525157100a000000000000000200000005000000201f41b5910a77a74f080853f4e0b781ba4deebbed23abc3871afdf826f2e1f077200d2c78f379c3f558d7e9c8ea49e94d3fe39d80f698da5427771da62d3ccb55ab4c50d0070000000000000062a94afb7f9d04e1ee7abe71528db30cf918638275b5f8947301271441b77f0000000000000000013f403d923d0bc96020a2b7255f2cb613fe41a78d7a3e0e18b44f224d2aa5af08d0070000000000001c158c1e0be04173ed4d956b71812683465d542939dd000532436f6465200929631c3375fa0cd639bb08da8c74b22a411939ea21b7ded7cbbe440696a996021c064c500000000000000000bfd7b1ec827416ef4f948f38a40515f286ee190304cf55b28e88ef0cd3b280e2e6ecd600000000005c34fadea75ada16c829a66c4d45552d43e4c67a8ac27a20eb2739a2ceaec9dd5247304402203c06d9f69f0e4d8bc32381608260d07081466bbb77d9ddc9766adb0b1080b037022004ce244423528897efdb3939613b5218de802eb870b3ba76f2318c9309cf29b6412103b2248e35bae5dbfb14839b7afe4765640d371b2c4c973badd97f4b57fb50c3594c50c4afc6a43754488bf9df4f1b17da1c31ae93b6c9f53201e5b572f28904b30a4c01000000ffffffff491d789ee47ba70d97de5d87d74b0d152d3506f9c73f7a9eaf8e556775f2ff5a00000000ffffffff100a000000000000000100000003000000202f45a34ff339550e64fe30fad329725523cdb90fd60525cfd95531517dddea3420b69d75e146dd6ed70ec7baa516dbf22bdffffa6aa0cb6b0c70b8b699b2f0533b28f82a0000000000000652490117ffe7fc9300b34af04efb948c28c601816076cccb72d9a8a2fe9d3b08243303000000000020b30f5a858a6f83399961162673a964a4bbdd15669cb1bed72e7be005dc5dd97c280000000000000000b33ce7554782442e039301c94ec7a7e87803b52a9ca855ba2a21210472da6011100a0000000000000002000000050000004c503d63bc84e86011ed588c8222c308ebd4cbc4d927e198ee667b55f874732d753f02000000ffffffffa46d3fb3c39f0242baca67b725a4e7cb315b7a9293978bf83f2dc78ee181a0b800000000ffffffff205f99af4a06ae03266099f3453e62dfe4dd041d7825af4c55c8d6ea6534ed40420008d0070000000000001c158a4274f167ecf97b8bf394b942425bff8f86efd3010532436f6465200929631c3375fa0cd639bb08da8c74b22a411939ea21b7ded7cbbe440696a996021c0608000000000000000045006a3000e8764817000000000000000000000000000000000000000000000000000000000000000000000000000000000000000106045553445404555344540546546170654c78d0070000000000001b64346e3be389f8b72ac01400ef2eb3458b9b221eff4f83b974bdefae735a8c0000000000000000751cd804c9a76bae2e617c08240d1284529f7f9a1e652376b18fa3af8321904d6c1d0000000000005c34fadea75ada16c829a66c4d45552d43e4c67a8ac27a20eb2739a2ceaec9ddffffffff06d007000000000000fd1c0659796b51798255947f05465461706588537f587f587f587f587f587f587f7581760087646c76550128957f01287f756b756b687c81760087646c76540128957f01287f756b756b68937c81760087646c76530128957f01287f756b756b68937c81760087646c76520128957f01287f756b756b68937c81760087646c76510128957f01287f756b756b68937c81760087646c76000128957f01287f756b756b68936c756b756ba87e6c7e527952797e6b53796b6bbb7e7e6c7ea87e6ba86c7e7ea8a856ba01207f75886c517f7701147f517f758176008763755179a988ad6751885279a9886b7e6b7600886c6c7e7ea87e7e7ea8a87801207f547f7581008888a855ba88ad687652876375527952797e6b6bbb7e7e6c7ea87e7e7ea8a86c6c766c6c01247f75766b01207f75557a887287636c756b6b676c2426f3ef4e6f748d01dc634afe11b9ed29f8f52d1a00d6bad5c378a41cd98f906200000000886b6b68687652876375527952797e6b6bbb7e7e6c7ea87e7e7ea8a86c6c766c6c01207f75557a8872886b6b687652876375527952797e6b6bbb7e7e6c7ea87e7e7ea8a86c6c766c6c01207f75557a8872886b6b687652876375527952797e6b6bbb7e7e6c7ea87e7e7ea8a86c6c766c6c01207f75557a8872886b6b687652876375527952797e6b6bbb7e7e6c7ea87e7e7ea8a86c6c766c6c01207f75557a8872886b6b687652876375527952797e6b6bbb7e7e6c7ea87e7e7ea8a86c6c766c6c01207f75557a8872886b6b68765287008857886c6c7c6b6b6b76528763757682760145876355947f05465461706588537f7c756c765895527a7c7f587f7581760087646c6c76597959797e886b6b686c7c946b756ba87e6bbb6c7e7e6c6c6c537a6b6b6b6b67750145876352798255947f0546546170658700887568bb7e6c6c6c537a6b6b6b6b686876528763757682760145876355947f05465461706588537f7c756c765895527a7c7f587f7581760087646c6c76597959797e886b6b686c7c946b756ba87e6bbb6c7e7e6c6c6c537a6c7e6b6b6b6b67750145876352798255947f0546546170658700887568bb7e6c6c6c537a6c7e6b6b6b6b686876528763757682760145876355947f05465461706588537f7c756c765895527a7c7f587f7581760087646c6c76597959797e886b6b686c7c946b756ba87e6bbb6c7e7e6c6c6c537a6c7e6b6b6b6b67750145876352798255947f0546546170658700887568bb7e6c6c6c537a6c7e6b6b6b6b686876528763757682760145876355947f05465461706588537f7c756c765895527a7c7f587f7581760087646c6c76597959797e886b6b686c7c946b756ba87e6bbb6c7e7e6c6c6c537a6c7e6b6b6b6b67750145876352798255947f0546546170658700887568bb7e6c6c6c537a6c7e6b6b6b6b686876528763757682760145876355947f05465461706588537f7c756c765895527a7c7f587f7581760087646c6c76597959797e886b6b686c7c946b756ba87e6bbb6c7e7e6c6c6c537a6c7e6b6b6b6b67750145876352798255947f0546546170658700887568bb7e6c6c6c537a6c7e6b6b6b6b686876528763757682760145876355947f05465461706588537f7c756c765895527a7c7f587f7581760087646c6c76597959797e886b6b686c7c946b756ba87e6bbb6c7e7e6c6c6c537a6c7e6b6b6b6b67750145876352798255947f0546546170658700887568bb7e6c6c6c537a6c7e6b6b6b6b686876528763757682760145876355947f05465461706588537f7c756c765895527a7c7f587f7581760087646c6c76597959797e886b6b686c7c946b756ba87e6bbb6c7e7e6c6c6c537a6c7e6b6b6b6b67750145876352798255947f0546546170658700887568bb7e6c6c6c537a6c7e6b6b6b6b686876528763757682760145876355947f05465461706588537f7c756c765895527a7c7f587f7581760087646c6c76597959797e886b6b686c7c946b756ba87e6bbb6c7e7e6c6c6c537a6c7e6b6b6b6b67750145876352798255947f0546546170658700887568bb7e6c6c6c537a6c7e6b6b6b6b686876528700886c6c00887551886c6ca857ba877717ffffffffffffffffffffffffffffffffffffffffffffff756a158a07aa9cc64d71ca194e2d695eb4d545e871235f000532436f6465000000000000000045006a300000000000000000b8221100000000000000000000000000000000000000000000000000000000000000000000000000010604555344540455534454054654617065d007000000000000fd1c0659796b51798255947f05465461706588537f587f587f587f587f587f587f7581760087646c76550128957f01287f756b756b687c81760087646c76540128957f01287f756b756b68937c81760087646c76530128957f01287f756b756b68937c81760087646c76520128957f01287f756b756b68937c81760087646c76510128957f01287f756b756b68937c81760087646c76000128957f01287f756b756b68936c756b756ba87e6c7e527952797e6b53796b6bbb7e7e6c7ea87e6ba86c7e7ea8a856ba01207f75886c517f7701147f517f758176008763755179a988ad6751885279a9886b7e6b7600886c6c7e7ea87e7e7ea8a87801207f547f7581008888a855ba88ad687652876375527952797e6b6bbb7e7e6c7ea87e7e7ea8a86c6c766c6c01247f75766b01207f75557a887287636c756b6b676c2426f3ef4e6f748d01dc634afe11b9ed29f8f52d1a00d6bad5c378a41cd98f906200000000886b6b68687652876375527952797e6b6bbb7e7e6c7ea87e7e7ea8a86c6c766c6c01207f75557a8872886b6b687652876375527952797e6b6bbb7e7e6c7ea87e7e7ea8a86c6c766c6c01207f75557a8872886b6b687652876375527952797e6b6bbb7e7e6c7ea87e7e7ea8a86c6c766c6c01207f75557a8872886b6b687652876375527952797e6b6bbb7e7e6c7ea87e7e7ea8a86c6c766c6c01207f75557a8872886b6b687652876375527952797e6b6bbb7e7e6c7ea87e7e7ea8a86c6c766c6c01207f75557a8872886b6b68765287008857886c6c7c6b6b6b76528763757682760145876355947f05465461706588537f7c756c765895527a7c7f587f7581760087646c6c76597959797e886b6b686c7c946b756ba87e6bbb6c7e7e6c6c6c537a6b6b6b6b67750145876352798255947f0546546170658700887568bb7e6c6c6c537a6b6b6b6b686876528763757682760145876355947f05465461706588537f7c756c765895527a7c7f587f7581760087646c6c76597959797e886b6b686c7c946b756ba87e6bbb6c7e7e6c6c6c537a6c7e6b6b6b6b67750145876352798255947f0546546170658700887568bb7e6c6c6c537a6c7e6b6b6b6b686876528763757682760145876355947f05465461706588537f7c756c765895527a7c7f587f7581760087646c6c76597959797e886b6b686c7c946b756ba87e6bbb6c7e7e6c6c6c537a6c7e6b6b6b6b67750145876352798255947f0546546170658700887568bb7e6c6c6c537a6c7e6b6b6b6b686876528763757682760145876355947f05465461706588537f7c756c765895527a7c7f587f7581760087646c6c76597959797e886b6b686c7c946b756ba87e6bbb6c7e7e6c6c6c537a6c7e6b6b6b6b67750145876352798255947f0546546170658700887568bb7e6c6c6c537a6c7e6b6b6b6b686876528763757682760145876355947f05465461706588537f7c756c765895527a7c7f587f7581760087646c6c76597959797e886b6b686c7c946b756ba87e6bbb6c7e7e6c6c6c537a6c7e6b6b6b6b67750145876352798255947f0546546170658700887568bb7e6c6c6c537a6c7e6b6b6b6b686876528763757682760145876355947f05465461706588537f7c756c765895527a7c7f587f7581760087646c6c76597959797e886b6b686c7c946b756ba87e6bbb6c7e7e6c6c6c537a6c7e6b6b6b6b67750145876352798255947f0546546170658700887568bb7e6c6c6c537a6c7e6b6b6b6b686876528763757682760145876355947f05465461706588537f7c756c765895527a7c7f587f7581760087646c6c76597959797e886b6b686c7c946b756ba87e6bbb6c7e7e6c6c6c537a6c7e6b6b6b6b67750145876352798255947f0546546170658700887568bb7e6c6c6c537a6c7e6b6b6b6b686876528763757682760145876355947f05465461706588537f7c756c765895527a7c7f587f7581760087646c6c76597959797e886b6b686c7c946b756ba87e6bbb6c7e7e6c6c6c537a6c7e6b6b6b6b67750145876352798255947f0546546170658700887568bb7e6c6c6c537a6c7e6b6b6b6b686876528700886c6c00887551886c6ca857ba877717ffffffffffffffffffffffffffffffffffffffffffffff756a158a4274f167ecf97b8bf394b942425bff8f86efd3010532436f6465000000000000000045006a30000000000000000048c56548170000000000000000000000000000000000000000000000000000000000000000000000010604555344540455534454054654617065842303000000000053567c01217f01217f01217f01217f01217f01217f01217f01217f01217f59795979597959795979597959795979597959797e7e7e7e7e7e7e7e7ea914a87114bb95a3ec4a16413b93b821b1641c122a34885aae000000000000000027006a2488888888f964f11d6fb0356e21c2d007e9ad8f6a8b2a17d0b4d2e3952236dc15460aa78800000000"
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree />
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>